app/controllers/availabilities_controller.rb

  def index
    @availabilities = Availability.all
---
SELECT "availabilities".* FROM "availabilities"

  def create
    @availability = Availability.new(availability_params)

    if @availability.save
---
INSERT INTO "availabilities" ("barber_id", "created_at", "updated_at", "start", "end") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["barber_id", 1], ["created_at", "2022-08-04 15:58:10.704550"], ["updated_at", "2022-08-04 15:58:10.704550"], ["start", nil], ["end", nil]]

  def destroy
    @availability.destroy
---
DELETE FROM "availabilities" WHERE "availabilities"."id" = $1  [["id", 5]]

    def set_availability
      @availability = Availability.find(params[:id])
---
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]