app/controllers/barbers_controller.rb

SELECT "barbers".* FROM "barbers"
---
  def index
    @barbers = Barber.all