app/controllers/barbers_controller.rb

SELECT "barbers".* FROM "barbers" WHERE "barbers"."store_id" = $1  [["store_id", 1]]
---
  def index
    @barbers = Barber.where(store_id:params[:store_id])

INSERT INTO "barbers" ("first_name", "last_name", "created_at", "updated_at", "store_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "asd"], ["last_name", "asd"], ["created_at", "2022-08-07 06:34:16.845041"], ["updated_at", "2022-08-07 06:34:16.845041"], ["store_id", 1]]
---
  def create
    @barber = Barber.new(barber_params)

    if @barber.save