app/controllers/clients_controller.rb

INSERT INTO "clients" ("first_name", "last_name", "phone", "email", "created_at", "updated_at", "store_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @client = Client.new(client_params)

    if @client.save