app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores"
---
  def index
    @stores = Store.all

INSERT INTO "stores" ("name", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "The Barber Shop"], ["location", "234 Hume hwy Auburn"], ["user_id", 1], ["created_at", "2022-08-10 16:08:04.468061"], ["updated_at", "2022-08-10 16:08:04.468061"]]
---
  def create
    @store = Store.new(store_params)

    if @store.save

UPDATE "stores" SET "name" = $1, "location" = $2, "updated_at" = $3 WHERE "stores"."id" = $4  [["name", "new Store"], ["location", "khara town"], ["updated_at", "2022-08-11 12:23:32.226436"], ["id", 1]]
---
  def update
    if @store.update(store_params)

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_store
      @store = Store.find(params[:id])