app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "Test"], ["email", "test@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-06-22 10:02:23.282414"], ["updated_at", "2022-06-22 10:02:23.282414"], ["admin", false]]
---
def create
    @user=User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "2345@gmail.com"], ["LIMIT", 1]]
---
def sign_in
    @user=User.find_by_email(params[:email])