app/models/booking.rb

SELECT "barbers".* FROM "barbers" WHERE "barbers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def transform_booking
    return{
      store_id: self.store.name,
      barber_id: self.barber.first_name,
      availability_id: self.availability.start,
      client_id: self.client.last_name,
      hair_style_id: self.hair_style.name,
    }